Ext.define('LibraryApp.store.Client', {
    extend: 'Ext.data.Store',
    alias: 'store.client',

    model: 'LibraryApp.model.Client',

    data: [{
        id: 1,
        name: 'Крак Мир Юриевич'
    }, {
        id: 2,
        name: 'Сорокина Софья Ильевна'
    }, {
        id: 3,
        name: 'Никоненко Елисей Платонович'
    }, {
        id: 4,
        name: 'Компанец Аким Сигизмундович'
    }, {
        id: 5,
        name: 'Балунова Ефросиния Василиевна'
    }, {
        id: 6,
        name: 'Сочинский Станислав Александрович'
    }, {
        id: 7,
        name: 'Энтина Зинаида Александровна'
    }, {
        id: 8,
        name: 'Кувардина Елена Трофимовна'
    }, {
        id: 9,
        name: 'Жеглов Адриан Федосиевич'
    }, {
        id: 10,
        name: 'Фастера Елизавета Мефодиевна'
    }]
});









